АлогистикТест2/src/Documents/алк_ЗагрузкаКонтейнера/алк_ЗагрузкаКонтейнера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаКонтейнера</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыНоменклатуры</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Documents/алк_Аддендумы/алк_Аддендумы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_Аддендумы</name>
  <comment>Уточнение договора на поставку товаров клиенту</comment>
  <registerRecords>AccumulationRegister.алк_Аддендумы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыАддендума</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУсловийПоставки</name>
    <type>
      <types>CatalogRef.алк_УсловияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАддендума</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАддендума</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияЗапрещены</name>
    <comment>Устанавливают после регистрации в ЛесЕГАИС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаРазрешена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеВручную</name>
      <comment>Если Да - пользователь вводит руками, если нет - перезаполняется по нашим алгоритмам</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияПЭО</name>
      <type>
        <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставТоваров</name>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаОт</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаДо</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПрипуска</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ЗагрузкаКонтейнера/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем СтарыйСписокНоменклатуры, СтрокиКУдалению;


#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка реквизитов формы.
	Пользователь = Пользователи.ТекущийПользователь();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) тогда
		Объект.Дата = ТекущаяДата();
		ПараметрыСмены = алк_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыСменыПоДате(Объект.Дата);
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСмены, "ДатаСмены, Смена");
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Участок) тогда
		ИспользоватьАддендумы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Участок, "ИспользуютсяАддендумы");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьУсловноеОформлениеФормы();
	МассивСписка = Новый Массив;
	Для каждого стр Из Объект.ВидыНоменклатуры Цикл
		МассивСписка.Добавить(стр.ВидНоменклатуры);	
	КонецЦикла; 
	СписокНоменклатуры.ЗагрузитьЗначения(МассивСписка);
	Множественность = ?(СписокНоменклатуры.Количество()=1, Ложь, Истина);
	//НастроитьТаблицуПоСпискуНоменклатуры();
	РассчитатьКоличествоПакетов();  
	
	УстановитьСмену(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СинхронизироватьСписокИТаблицу();
	
	//ПараметрыОтбора = Новый Структура("Идентифицирован", Ложь);
	//МассивСтрок = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
	//Если МассивСтрок.Количество() > 0 Тогда
	//	СтрокиКУдалению = Новый Массив;
	//	Для каждого стр Из МассивСтрок Цикл
	//		СтрокиКУдалению.Добавить(стр);	
	//	КонецЦикла; 		
	//	
	//	Режим = РежимДиалогаВопрос.ДаНет;
	//	Оповещение = Новый ОписаниеОповещения("ВопросНеидентифицированныеСтроки", ЭтаФорма);
	//	ПоказатьВопрос(Оповещение, "В табличной части ""Запасы"" имеются строки,
	//	| с неидентифицированными пакетами." + Символы.ПС +
	//	"Удалить эти строки?", Режим, 0, ,"");
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросНеидентифицированныеСтроки(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для каждого стр Из СтрокиКУдалению Цикл
			Объект.Запасы.Удалить(стр);	
		КонецЦикла;
	Иначе
		
	КонецЕсли;
	
	СтрокиКУдалению = Неопределено;
	
КонецПроцедуры



#КонецОбласти 


#Область СобытияЭлементов

///////////////////////// Выбор видов номенклатуры из списка

&НаКлиенте
Процедура СписокНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокДляВыбора = СписокНоменклатурыНачалоВыбораНаСервере(СписокНоменклатуры);
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтаФорма);
	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Виды номенклатуры.");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокНоменклатурыНачалоВыбораНаСервере(СписокНоменклатуры)
	
	СписокДляВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииНоменклатуры.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА КатегорииНоменклатуры.Ссылка В (&СписокНоменклатуры)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка,,ВыборкаДетальныеЗаписи.Пометка);		
	КонецЦикла;
	
	Возврат СписокДляВыбора;
	
КонецФункции

&НаКлиенте
Процедура ПослеОтметкиЭлементов(СписокДляВыбора, Параметры) Экспорт
	
	Если СписокДляВыбора = Неопределено Тогда
		//Сообщить("Отказ от пометк.");
	Иначе
		СтарыйСписокНоменклатуры = СписокНоменклатуры.Скопировать();
		
		СписокНоменклатуры.Очистить();
		Для каждого Элемент Из СписокДляВыбора Цикл
			Если Элемент.Пометка Тогда
				СписокНоменклатуры.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
		
		СписокУдаленных = Новый СписокЗначений;
		Для каждого стр Из СтарыйСписокНоменклатуры Цикл
			Если СписокНоменклатуры.НайтиПоЗначению(стр.Значение) = Неопределено Тогда
				СписокУдаленных.Добавить(стр.Значение);	
			КонецЕсли; 	
		КонецЦикла;
		
		ЛишниеСтроки = НеСоответствующиеСпискуВидов(СписокУдаленных);
		
		Если ЛишниеСтроки.Количество() > 0 Тогда
			СтрокиКУдалению = Новый Массив;
			Для каждого стрЛишниеСтроки Из ЛишниеСтроки Цикл
				СтрокиКУдалению.Добавить(стрЛишниеСтроки);	
			КонецЦикла; 
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ВопросЕстьЛишниеСтроки", ЭтаФорма);
			ПоказатьВопрос(Оповещение, "В табличной части ""Продукция"" имеются строки, с номенклатурой
			| не выбранной в списке ""Виды номенклатуры""." + Символы.ПС +
			"Удалить лишние строки?", Режим, 0, ,"");
		Иначе
			СтрокиКУдалению = Неопределено;
			СинхронизироватьСписокИТаблицу();
			
			Множественность = ?(СписокНоменклатуры.Количество()=1, Ложь, Истина);
			//НастроитьТаблицуПоСпискуНоменклатуры();
			
		КонецЕсли; 	
		
	КонецЕсли;
	
КонецПроцедуры

//////////////////////// События табличного поля "Запасы"

&НаКлиенте
Процедура ЗапасыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Если СписокНоменклатуры.Количество() = 0 Тогда
	//	// Сообщить о необходимости добавить вид номенклатуры
	//	Отказ = Истина;
	//	Оповещение = Новый ОписаниеОповещения("НеобходимоЗаполнитьВидНоменклатуры", ЭтаФорма);
	//	ПоказатьПредупреждение(Оповещение, "Необходимо указать Номенклатуру в шапке документа!",,"Не заполнены поля");	
	//КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура НеобходимоЗаполнитьВидНоменклатуры(ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Возврат;	
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекДанные =	Элемент.ТекущиеДанные;
		Если Не Множественность Тогда
			ТекДанные.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(СписокНоменклатуры[0].Значение);	
		КонецЕсли;
	Иначе
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	// Заполнить параметры пакета
	
	НомерПакета = ТекДанные.НомерСерии;
	
	Если ЗначениеЗаполнено(НомерПакета) Тогда
		
		Год = НачалоГода(ТекущаяДата());		
		ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатуры(ТекДанные.Номенклатура, НомерПакета, Год);
		ЗаполнитьЗначенияСвойств(ТекДанные, ПараметрыПакета);
		
		Если Не ЗначениеЗаполнено(ТекДанные.СерийныйНомер) Тогда 
			
			Год = НачалоГода(Год - 1); 			
			ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатуры(ТекДанные.Номенклатура, НомерПакета, Год);
			ЗаполнитьЗначенияСвойств(ТекДанные, ПараметрыПакета);
			
			Если Не ЗначениеЗаполнено(ТекДанные.СерийныйНомер) Тогда
				
				Год = НачалоГода(Год - 1);
				ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатуры(ТекДанные.Номенклатура, НомерПакета, Год);
				ЗаполнитьЗначенияСвойств(ТекДанные, ПараметрыПакета); 
				
			КонецЕсли; 
		
		КонецЕсли;
		
		ТекДанные.КоличествоПакетов = 1; 	
		
	КонецЕсли; 
		
	//Отбор = Новый Структура();
	//Отбор.Вставить("Номенклатура", ТекДанные.Номенклатура);
	//Отбор.Вставить("Характеристика", ТекДанные.Характеристика);
	//Строки = ТаблицаАссортиментаЗаказа.НайтиСтроки(Отбор);
	//Если Строки.Количество() > 0 Тогда
	//	ТекДанные.СоотвАссортиментуЗаказа = Истина;	
	//Иначе
	//	ТекДанные.СоотвАссортиментуЗаказа = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

//////////////////////События поля Ид контейнера

&НаКлиенте
Процедура ИдентификаторКонтейнераПриИзменении(Элемент)
	Если РфпПолучениеДанныхСервер.ПроверитьИдентификаторКонтейнераНаСервере(Элемент.ТекстРедактирования)Тогда
		Элемент.ЦветФона = Новый Цвет();
	Иначе
		Элемент.ЦветФона = WebЦвета.Лосось;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 


#Область ОбщегоНазначения

&НаКлиенте
Функция НеСоответствующиеСпискуВидов(СписокЛишних)
	
	МассивЛишнихСтрок = Новый Массив;
	Для каждого стрЗапасы Из Объект.Запасы Цикл
		Если СписокЛишних.НайтиПоЗначению(стрЗапасы.Номенклатура) <> Неопределено Тогда
			МассивЛишнихСтрок.Добавить(стрЗапасы);	
		КонецЕсли; 	
	КонецЦикла; 
	Возврат МассивЛишнихСтрок;
	
КонецФункции

&НаКлиенте
Процедура СинхронизироватьСписокИТаблицу()	
	
	Объект.ВидыНоменклатуры.Очистить();
	Для каждого элт Из СписокНоменклатуры Цикл
		НовСтр = Объект.ВидыНоменклатуры.Добавить();
		НовСтр.ВидНоменклатуры = элт.Значение;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти 

&НаСервере
Процедура ОбновитьДааныеПакетовНаСервере()
	
	
	
	Для каждого Стр Из Объект.Запасы Цикл
		
		НомерПакета = Стр.НомерСерии;
		
		Если ЗначениеЗаполнено(НомерПакета) Тогда
			
			Год = НачалоГода(ТекущаяДата());		
			ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатуры(Стр.Номенклатура, НомерПакета, Год);
			ЗаполнитьЗначенияСвойств(Стр, ПараметрыПакета);
			
			Если Не ЗначениеЗаполнено(Стр.СерийныйНомер) Тогда 
				
				Год = НачалоГода(Год - 1); 			
				ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатуры(Стр.Номенклатура, НомерПакета, Год);
				ЗаполнитьЗначенияСвойств(Стр, ПараметрыПакета);
				
				Если Не ЗначениеЗаполнено(Стр.СерийныйНомер) Тогда
					
					Год = НачалоГода(Год - 1);
					ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатуры(Стр.Номенклатура, НомерПакета, Год);
					ЗаполнитьЗначенияСвойств(Стр, ПараметрыПакета); 
					
				КонецЕсли; 
				
			КонецЕсли;
			
			Стр.КоличествоПакетов = 1; 	
			
		КонецЕсли;  	
		
	КонецЦикла; 
	
	
	
	//
	//	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	алк_ЗагрузкаКонтейнераЗапасы.НомерСтроки,
	//	|	алк_ЗагрузкаКонтейнераЗапасы.Номенклатура,
	//	|	алк_ЗагрузкаКонтейнераЗапасы.СерийныйНомер,
	//	|	алк_ЗагрузкаКонтейнераЗапасы.Характеристика,
	//	|	алк_ЗагрузкаКонтейнераЗапасы.КоличествоПакетов,
	//	|	алк_ЗагрузкаКонтейнераЗапасы.НомерСерии,
	//	|	алк_ЗагрузкаКонтейнераЗапасы.Идентифицирован
	//	|ПОМЕСТИТЬ ВТ_Пакеты
	//	|ИЗ
	//	|	Документ.алк_ЗагрузкаКонтейнера.Запасы КАК алк_ЗагрузкаКонтейнераЗапасы
	//	|ГДЕ
	//	|	алк_ЗагрузкаКонтейнераЗапасы.Ссылка = &Ссылка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Пакеты.НомерСтроки КАК НомерСтроки,
	//	|	ВТ_Пакеты.Номенклатура,
	//	|	ВТ_Пакеты.СерийныйНомер,
	//	|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
	//	|	ВТ_Пакеты.КоличествоПакетов,
	//	|	алк_ПараметрыПакетовСрезПоследних.НомерПакета КАК НомерСерии,
	//	|	ВТ_Пакеты.Идентифицирован,
	//	|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
	//	|	алк_ПараметрыПакетовСрезПоследних.Объем
	//	|ИЗ
	//	|	ВТ_Пакеты КАК ВТ_Пакеты
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	//	|				&ДатаСреза,
	//	|				СерийныйНомер В
	//	|					(ВЫБРАТЬ
	//	|						ВТ_Пакеты.СерийныйНомер
	//	|					ИЗ
	//	|						ВТ_Пакеты КАК ВТ_Пакеты)) КАК алк_ПараметрыПакетовСрезПоследних
	//	|		ПО ВТ_Пакеты.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	НомерСтроки";
	//
	//Запрос.УстановитьПараметр("ДатаСреза", КонецДня(Объект.Дата));
	//Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//
	//Объект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
	                    	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДааныеПакетов(Команда)
	
	Если Модифицированность Тогда
		Сообщить("Перед обновлением данных документ нужно записать!");   
		Возврат;
	КонецЕсли; 
	
	ОбновитьДааныеПакетовНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Участок) Тогда
		РеквизитыУчастка = РфпПолучениеДанныхСервер.ЗначенияРеквизитовОбъекта(Объект.Участок, "СкладСписания, Организация, ИспользуютсяАддендумы");
		//Объект.СтруктурнаяЕдиница = РеквизитыУчастка.СкладСписания;
		Объект.Организация = РеквизитыУчастка.Организация;
		ИспользоватьАддендумы = РеквизитыУчастка.ИспользуютсяАддендумы;
	Иначе
		ИспользоватьАддендумы = Ложь;
	КонецЕсли; 
	
	УстановитьУсловноеОформлениеФормы(); 
	
	УстановитьСмену(); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьУсловноеОформлениеФормы()
	
	Элементы.СписокНоменклатуры.Видимость = Не ИспользоватьАддендумы;
	Элементы.ЗапасыСтараяСхема.Видимость = Не ИспользоватьАддендумы;
	Элементы.Запасы.Видимость = ИспользоватьАддендумы;
	
	Элементы.ГрКнЗапасы.Доступность  				= ЗначениеЗаполнено(Объект.Заказ);
	Элементы.ДекорЗапретИзмененияТоваров.Видимость 	= Не ЗначениеЗаполнено(Объект.Заказ) и ИспользоватьАддендумы;   
	
	
	Если ИспользоватьАддендумы Тогда 		
		Если Не ТипЗнч(Объект.Заказ) = Тип("ДокументСсылка.алк_Аддендумы") Тогда
			Объект.Заказ = ПредопределенноеЗначение("Документ.алк_Аддендумы.ПустаяСсылка");		
		КонецЕсли;	
	Иначе
	    Если Не ТипЗнч(Объект.Заказ) = Тип("ДокументСсылка.алк_ЗаказПокупателя") Тогда
			Объект.Заказ = ПредопределенноеЗначение("Документ.алк_ЗаказПокупателя.ПустаяСсылка");		
		КонецЕсли; 
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент) 	
	УстановитьСмену();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличествоПакетов()
	Если ИспользоватьАддендумы тогда
		Возврат;
	КонецЕсли;
	
	МассивСерийныхНомеров = новый массив;
	Для каждого Товар из Объект.Запасы Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСерийныхНомеров, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Товар.СерийныйНомер), Истина);
	КонецЦикла;
	ИтогКоличествоПакетов = МассивСерийныхНомеров.Количество();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодобратьПакеты(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора"		, Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("Организация"		, Объект.Организация);
	ПараметрыФормы.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Если ЗначениеЗаполнено(Объект.Заказ) тогда
		ПараметрыФормы.Вставить("Аддендум"		, Объект.Заказ);
	КонецЕсли;
	ПараметрыФормы.Вставить("ТолькоСОстатками"	, Истина);
	
	ОткрытьФорму("Справочник.СерийныеНомера.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	МассивСсылок = ВыбранноеЗначение;
	ЗаполнитьТабличнуюЧастьСерийнымиНомерамиНаСервере(МассивСсылок);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьСерийнымиНомерамиНаСервере(МассивСсылок)
	Счетчик = МассивСсылок.Количество();
	Пока Счетчик > 0 Цикл
		Счетчик = Счетчик - 1;
		ПараметрыОтбора = Новый структура("СерийныйНомер", МассивСсылок[Счетчик]);
		НайденныеСтроки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("В табличной части %1 уже имеется серийный номер %2", Элементы.Запасы.Имя, МассивСсылок[Счетчик]),
				МассивСсылок[Счетчик], "Запасы", "Объект.Запасы");
			МассивСсылок.Удалить(Счетчик);	
		КонецЕсли;
	КонецЦикла;
	
	СтруктураСерийныхНомеров = РегистрыНакопления.алк_ОстаткиЗапасов.ПолучитьСтруктуруОстатковПакетов(МассивСсылок, Объект.Дата);
	Для каждого СерийныйНомер из СтруктураСерийныхНомеров Цикл
		Для каждого ПараметрПакета из СерийныйНомер.МассивПараметров Цикл
			НовыйТовар = Объект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар, ПараметрПакета);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПакет(Команда)
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено тогда
		Сообщить("Не выделена строка для удаления серийного номера");
		Возврат;
	КонецЕсли;
	СерийныйНомерДляУдаления = ТекущаяСтрока.СерийныйНомер;
	УдалитьСерийныйНомерИзТоваров(СерийныйНомерДляУдаления);
КонецПроцедуры

Процедура УдалитьСерийныйНомерИзТоваров(СерийныйНомер) 
	ПараметрыОтбора = Новый структура("СерийныйНомер", СерийныйНомер);
	НайденныеСтроки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
	Для каждого СтрокаДляУдаления из НайденныеСтроки Цикл
		Объект.Запасы.Удалить(СтрокаДляУдаления);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюПоПакетам(Команда)
	МассивСерийныхНомеров = новый массив;
	Для каждого Товар из Объект.Запасы Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСерийныхНомеров
			, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Товар.СерийныйНомер), Истина);
	КонецЦикла;
	Объект.Запасы.Очистить();
	ЗаполнитьТабличнуюЧастьСерийнымиНомерамиНаСервере(МассивСерийныхНомеров);
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	РассчитатьКоличествоПакетов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	УстановитьУсловноеОформлениеФормы();
КонецПроцедуры



&НаСервере
Процедура УстановитьСмену() 
	
	//Заполним ДатаСмены и Смена автоматом
	Если ЗначениеЗаполнено(Объект.Участок) Тогда
		ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок, Объект.Дата);
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена");
	КонецЕсли;    
	
КонецПроцедуры
